In [1]:
import pandas as pd
import numpy as np
# Configuracion
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)
pd.set_option('display.expand_frame_repr', False)

# Aplicando Apply

In [7]:
# DataSet
notas = pd.Series([15, 18, 12, 20, 9, 14])

# Funcion
def cond_nota(nota):
    if nota >= 11:
        return 'Aprobado'
    else:
        return 'Desaprobado'

print("Funciób creada correctamente.")

Funciób creada correctamente.

In [8]:
# Clasificar notas con una función
condicion = notas.apply(cond_nota)

# Reporte
print("Notas:", notas.values)
print("Condicion:", condicion.values)

Notas: [15 18 12 20  9 14]
Condicion: ['Aprobado' 'Aprobado' 'Aprobado' 'Aprobado' 'Desaprobado' 'Aprobado']

In [9]:
# Clasificar notas con una función lambda
clasificacion = notas.apply(
lambda x: 'Aprobado' if x >= 11 else 'Desaprobado')

# Reporte
print("Notas:", notas.values)
print("Condicion:", condicion.values)

Notas: [15 18 12 20  9 14]
Condicion: ['Aprobado' 'Aprobado' 'Aprobado' 'Aprobado' 'Desaprobado' 'Aprobado']

In [10]:
print("Juntar como columnas")
df1 = pd.concat([notas, condicion], axis=1)
print(df1)

Juntar como columnas
    0            1
0  15     Aprobado
1  18     Aprobado
2  12     Aprobado
3  20     Aprobado
4   9  Desaprobado
5  14     Aprobado

In [11]:
print("Creando un DataFrame")
df2 = pd.DataFrame({
'Nota': notas,
'Estado': condicion
})
print(df2)

Creando un DataFrame
   Nota       Estado
0    15     Aprobado
1    18     Aprobado
2    12     Aprobado
3    20     Aprobado
4     9  Desaprobado
5    14     Aprobado


# Método .map()

In [13]:
genero = pd.Series(['M', 'F', 'M', 'F', 'M'])
mapa = {'M': 'Masculino', 'F': 'Femenino'}

print(genero)
print("-" * 20)
print(genero.map(mapa))

0    M
1    F
2    M
3    F
4    M
dtype: object
--------------------
0    Masculino
1     Femenino
2    Masculino
3     Femenino
4    Masculino
dtype: object

In [14]:
df = pd.read_csv('rrhh.csv')
print(df)
# Columna calculada
df['ingreso_anual'] = df['salario'] * 12
print(df)

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero
..           ...      ...   ...       ...          ...      ...          ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero

[200 rows x 7 columns]
     id_empleado   nombre  edad    ciudad departamento  salario estado_civil  ingreso_anual
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado        80136.0
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero        54576.0
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0
..           ...      ...   ...       ...          ...      ...          ...            ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0

[200 rows x 8 columns]

In [15]:
def cond_salario(salario):
    if salario > 4500:
        return 'Alto'
    elif salario > 3500:
        return 'Medio'
    else:
        return 'Básico'

# Aplicando la funcion
df['nivel'] = df['salario'].apply(cond_salario)
print(df)

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil  ingreso_anual   nivel
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado        80136.0    Alto
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0    Alto
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero        54576.0    Alto
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0    Alto
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0    Alto
..           ...      ...   ...       ...          ...      ...          ...            ...     ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0    Alto
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN  Básico
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0  Básico
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0    Alto
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0   Medio

[200 rows x 9 columns]

In [16]:
# Columna condicional con .apply()
df['nivel'] = df['salario'].apply(
     lambda x: 'Alto2' if x > 4500 else ('Medio2' if x > 3500 else 'Básico2')
)
print(df)

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil  ingreso_anual    nivel
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado        80136.0    Alto2
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0    Alto2
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero        54576.0    Alto2
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0    Alto2
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0    Alto2
..           ...      ...   ...       ...          ...      ...          ...            ...      ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0    Alto2
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN  Básico2
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0  Básico2
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0    Alto2
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0   Medio2

[200 rows x 9 columns]

# Aplicando where

In [18]:
# Columna con numpy (más eficiente en datasets grandes)
df['bono'] = np.where(df['salario'] > 4000, df['salario'] * 0.10, 0)
print(df[['nombre', 'salario', 'nivel', 'bono']].head(10))

    nombre  salario    nivel   bono
0    Lucía   6678.0    Alto2  667.8
1   Carlos   7764.0    Alto2  776.4
2   Camila   4548.0    Alto2  454.8
3  Daniela   6646.0    Alto2  664.6
4  Valeria   7280.0    Alto2  728.0
5    Pedro   3216.0  Básico2    0.0
6   Camila   7044.0    Alto2  704.4
7    Elena   7476.0    Alto2  747.6
8    Lucía   7083.0    Alto2  708.3
9    Diego   4323.0   Medio2  432.3

In [23]:
# df completo
print(df)
# Eliminar columna (axis=1 indica columnas)
df_sin_bono = df.drop('bono', axis=1)
print(df_sin_bono)

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil  ingreso_anual    nivel   bono
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado        80136.0    Alto2  667.8
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0    Alto2  776.4
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero        54576.0    Alto2  454.8
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0    Alto2  664.6
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0    Alto2  728.0
..           ...      ...   ...       ...          ...      ...          ...            ...      ...    ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0    Alto2  754.2
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN  Básico2    0.0
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0  Básico2    0.0
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0    Alto2  526.2
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0   Medio2    0.0

[200 rows x 10 columns]
     id_empleado   nombre  edad    ciudad departamento  salario estado_civil  ingreso_anual    nivel
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado        80136.0    Alto2
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0    Alto2
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero        54576.0    Alto2
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0    Alto2
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0    Alto2
..           ...      ...   ...       ...          ...      ...          ...            ...      ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0    Alto2
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN  Básico2
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0  Básico2
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0    Alto2
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0   Medio2

[200 rows x 9 columns]

In [25]:
# df completo
print(df)

# Eliminar múltiples columnas
df_temp = df.drop(['bono', 'ingreso_anual'], axis=1, inplace=False)
print(df_temp)

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil  ingreso_anual    nivel   bono
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado        80136.0    Alto2  667.8
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0    Alto2  776.4
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero        54576.0    Alto2  454.8
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0    Alto2  664.6
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0    Alto2  728.0
..           ...      ...   ...       ...          ...      ...          ...            ...      ...    ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0    Alto2  754.2
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN  Básico2    0.0
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0  Básico2    0.0
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0    Alto2  526.2
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0   Medio2    0.0

[200 rows x 10 columns]
     id_empleado   nombre  edad    ciudad departamento  salario estado_civil    nivel
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado    Alto2
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero    Alto2
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero    Alto2
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado    Alto2
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero    Alto2
..           ...      ...   ...       ...          ...      ...          ...      ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero    Alto2
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero  Básico2
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado  Básico2
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero    Alto2
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero   Medio2

[200 rows x 8 columns]

# Eliminar filas

In [35]:
print(df)
print('-' * 20)
# Eliminar filas por índice (axis=0 es el default)
df_temp = df.drop([0, 2, 5], axis=0) # Elimina las filas: 0, 2 y 5
print("Filas df:",len(df))
print("Filas df_temp:",len(df_temp))
print(df_temp)

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil  ingreso_anual    nivel   bono
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado        80136.0    Alto2  667.8
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0    Alto2  776.4
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero        54576.0    Alto2  454.8
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0    Alto2  664.6
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0    Alto2  728.0
..           ...      ...   ...       ...          ...      ...          ...            ...      ...    ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0    Alto2  754.2
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN  Básico2    0.0
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0  Básico2    0.0
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0    Alto2  526.2
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0   Medio2    0.0

[200 rows x 10 columns]
--------------------
Filas df: 200
Filas df_temp: 197
     id_empleado   nombre  edad    ciudad departamento  salario estado_civil  ingreso_anual    nivel   bono
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0    Alto2  776.4
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0    Alto2  664.6
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0    Alto2  728.0
6              7   Camila  33.0  Arequipa     Finanzas   7044.0       Casado        84528.0    Alto2  704.4
7              8    Elena  52.0  Trujillo     Sistemas   7476.0       Casado        89712.0    Alto2  747.6
..           ...      ...   ...       ...          ...      ...          ...            ...      ...    ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0    Alto2  754.2
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN  Básico2    0.0
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0  Básico2    0.0
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0    Alto2  526.2
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0   Medio2    0.0

[197 rows x 10 columns]

In [40]:
# DataFrame local
data = {
'id_empleado': [1, 2, 3, 4, 2, 5, 3],
'nombre': ['Ana', 'Luis', 'María', 'Carlos', 'Luis', 'Elena', 'María'],
'salario': [3500, 4200, 3800, 5100, 4200, 3200, 3800]
}
dfl = pd.DataFrame(data)
print("DataFrame local:")
print(dfl)

print("Detectar filas duplicadas")
print("Cantidad:",dfl.duplicated().sum()) # Cuenta la cantidad de filas duplicadas
print(dfl.duplicated())
# Eliminar filas duplicadas
df_sin_duplicados = dfl.drop_duplicates()
print("DataFrame sin duplicados:")
print(df_sin_duplicados)

DataFrame local:
   id_empleado  nombre  salario
0            1     Ana     3500
1            2    Luis     4200
2            3   María     3800
3            4  Carlos     5100
4            2    Luis     4200
5            5   Elena     3200
6            3   María     3800
Detectar filas duplicadas
Cantidad: 2
0    False
1    False
2    False
3    False
4     True
5    False
6     True
dtype: bool
DataFrame sin duplicados:
   id_empleado  nombre  salario
0            1     Ana     3500
1            2    Luis     4200
2            3   María     3800
3            4  Carlos     5100
5            5   Elena     3200

# DataFrame sin filas duplicadas

In [42]:
data = {
'id_empleado': [1, 2, 3, 4, 2, 5, 3],
'nombre': ['Ana', 'Luis', 'María', 'Carlos', 'Luis', 'Elena', 'María'],
'salario': [3500, 4200, 3800, 5100, 5200, 3200, 4800]
}
dfl = pd.DataFrame(data)
print("DataFrame local:")
print(dfl)
print("Detectar filas duplicadas")
print("Cantidad:",dfl.duplicated().sum())
print(dfl.duplicated())

DataFrame local:
   id_empleado  nombre  salario
0            1     Ana     3500
1            2    Luis     4200
2            3   María     3800
3            4  Carlos     5100
4            2    Luis     5200
5            5   Elena     3200
6            3   María     4800
Detectar filas duplicadas
Cantidad: 0
0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [43]:
# Eliminar filas duplicadas
dfl.drop_duplicates(subset=['id_empleado'], inplace=True)
print("DataFrame sin duplicados:")
print(dfl)

DataFrame sin duplicados:
   id_empleado  nombre  salario
0            1     Ana     3500
1            2    Luis     4200
2            3   María     3800
3            4  Carlos     5100
5            5   Elena     3200

# Renombrar columnas

In [56]:
print("Columnas originales:", df.columns)
# Renombrar columnas específicas con diccionario
df.rename(columns={'nombre': 'empleado', 'if': 'sede'}, inplace=True)
print("Nuevas columnas:", df.columns)
print(df)
print(df.empleado) # Solo se puede utilizar si el nombre de columna no tiene espacios en blanco y no es una palabra reservada
print(df["sede"])

Columnas originales: Index(['id_empleado', 'empleado', 'edad', 'if', 'departamento', 'salario',
       'estado_civil', 'ingreso_anual', 'nivel', 'bono'],
      dtype='object')
Nuevas columnas: Index(['id_empleado', 'empleado', 'edad', 'sede', 'departamento', 'salario',
       'estado_civil', 'ingreso_anual', 'nivel', 'bono'],
      dtype='object')
     id_empleado empleado  edad      sede departamento  salario estado_civil  ingreso_anual    nivel   bono
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado        80136.0    Alto2  667.8
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero        93168.0    Alto2  776.4
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero        54576.0    Alto2  454.8
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado        79752.0    Alto2  664.6
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero        87360.0    Alto2  728.0
..           ...      ...   ...       ...          ...      ...          ...            ...      ...    ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero        90504.0    Alto2  754.2
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero            NaN  Básico2    0.0
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado        40152.0  Básico2    0.0
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero        63144.0    Alto2  526.2
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero        43692.0   Medio2    0.0

[200 rows x 10 columns]
0        Lucía
1       Carlos
2       Camila
3      Daniela
4      Valeria
        ...
195        Ana
196     Carlos
197     Camila
198     Carlos
199    Ricardo
Name: empleado, Length: 200, dtype: object
0         Piura
1      Trujillo
2          Lima
3      Chiclayo
4      Chiclayo
         ...
195    Arequipa
196        Lima
197    Trujillo
198    Trujillo
199       Piura
Name: sede, Length: 200, dtype: object

In [71]:
dfl = pd.DataFrame({
'Nombre Empleado': ['Ana Torres', 'Luis Gómez', 'María Pérez'],
'Edad Persona ': [25, 30, 28],
'Ciudad Trabajo': ['Lima', 'Cusco', 'Arequipa'],
'Salario Base': [3500, 4200, 3800]
})
print("Columnas originales:")
print(dfl.columns)
print(dfl['Nombre Empleado'])
print(dfl)

Columnas originales:
Index(['Nombre Empleado', 'Edad Persona ', 'Ciudad Trabajo', 'Salario Base'], dtype='object')
0     Ana Torres
1     Luis Gómez
2    María Pérez
Name: Nombre Empleado, dtype: object
  Nombre Empleado  Edad Persona  Ciudad Trabajo  Salario Base
0      Ana Torres             25           Lima          3500
1      Luis Gómez             30          Cusco          4200
2     María Pérez             28       Arequipa          3800

In [62]:
dfl.columns = ['Empleado', 'Edad', 'Sede', 'Salario']
print("Después de reemplazar manualmente:")
print(dfl.columns)
print(dfl)

Después de reemplazar manualmente:
Index(['Empleado', 'Edad', 'Sede', 'Salario'], dtype='object')
      Empleado  Edad      Sede  Salario
0   Ana Torres    25      Lima     3500
1   Luis Gómez    30     Cusco     4200
2  María Pérez    28  Arequipa     3800

In [72]:
print("Originales")
print(dfl)

dfl.columns = (dfl.columns
               .str.strip()
               .str.lower()
               .str.replace(' ', '_')
              )
print("Después de estandarizar:")
print(dfl.columns)
print(dfl)

Originales
  Nombre Empleado  Edad Persona  Ciudad Trabajo  Salario Base
0      Ana Torres             25           Lima          3500
1      Luis Gómez             30          Cusco          4200
2     María Pérez             28       Arequipa          3800
Después de estandarizar:
Index(['nombre_empleado', 'edad_persona', 'ciudad_trabajo', 'salario_base'], dtype='object')
  nombre_empleado  edad_persona ciudad_trabajo  salario_base
0      Ana Torres            25           Lima          3500
1      Luis Gómez            30          Cusco          4200
2     María Pérez            28       Arequipa          3800

# Manejo de datos faltantes NaN

In [80]:
df = pd.read_csv('rrhh.csv')
print(df)

# Mapa de nulos (True donde hay NaN)
df.isnull()
# Conteo de nulos por columna
print(df.isnull().sum())
# Porcentaje de nulos por columna
df.isnull().sum() / len(df) * 100
# Filas que tienen al menos un nulo
df[df.isnull().any(axis=1)]
# Cantidad de filas con almenos un valor nulo
print(f"Filas totales: {len(df)}")
print(f"Filas con al menos un nulo: {len(df[df.isnull().any(axis=1)])}")

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero
..           ...      ...   ...       ...          ...      ...          ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero

[200 rows x 7 columns]
id_empleado      0
nombre           0
edad            10
ciudad          10
departamento     0
salario         10
estado_civil    10
dtype: int64
Filas totales: 200
Filas con al menos un nulo: 38

In [81]:
# Eliminar filas con cualquier nulo
df_new = df.dropna()
df_new

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero
5              6    Pedro  56.0  Trujillo  Operaciones   3216.0       Casado
..           ...      ...   ...       ...          ...      ...          ...
193          194  Daniela  46.0     Piura  Operaciones   5428.0   Divorciado
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero

[162 rows x 7 columns]

In [82]:
# Eliminar filas solo si TODAS las columnas son nulas
df_new = df.dropna(how='all')
df_new

     id_empleado   nombre  edad    ciudad departamento  salario estado_civil
0              1    Lucía  57.0     Piura       Ventas   6678.0   Divorciado
1              2   Carlos  43.0  Trujillo     Sistemas   7764.0      Soltero
2              3   Camila   NaN      Lima     Finanzas   4548.0      Soltero
3              4  Daniela  35.0  Chiclayo       Ventas   6646.0   Divorciado
4              5  Valeria  49.0  Chiclayo     Finanzas   7280.0      Soltero
..           ...      ...   ...       ...          ...      ...          ...
195          196      Ana  45.0  Arequipa    Marketing   7542.0      Soltero
196          197   Carlos  44.0      Lima    Marketing      NaN      Soltero
197          198   Camila  33.0  Trujillo    Marketing   3346.0       Casado
198          199   Carlos  27.0  Trujillo    Marketing   5262.0      Soltero
199          200  Ricardo  56.0     Piura         RRHH   3641.0      Soltero

[200 rows x 7 columns]

In [83]:
# Paso 1
# Crear el DataFrame de ejemplo
data = {
'estudiante': ['Ana', 'Luis', 'María', 'Carlos', 'Rosa', 'Jorge'],
'nota_1': [15, 12, None, 14, None, 11 ],
'nota_2': [18, None, 16, None, None, 13 ],
'nota_3': [None, None, None, None, None, None ],
'nota_4': [14, 15, 13, 16, 12, None ],
}

df_notas = pd.DataFrame(data)
print("DataFrame original:")
print(df_notas)
print()

DataFrame original:
  estudiante  nota_1  nota_2 nota_3  nota_4
0        Ana    15.0    18.0   None    14.0
1       Luis    12.0     NaN   None    15.0
2      María     NaN    16.0   None    13.0
3     Carlos    14.0     NaN   None    16.0
4       Rosa     NaN     NaN   None    12.0
5      Jorge    11.0    13.0   None     NaN

In [84]:
# Paso 2
# Ver el porcentaje de nulos por columna
print("Porcentaje de nulos por columna:")
print((df_notas.isnull().sum() / len(df_notas) * 100).round(1).astype(str) + " %")
print()

Porcentaje de nulos por columna:
estudiante      0.0 %
nota_1         33.3 %
nota_2         50.0 %
nota_3        100.0 %
nota_4         16.7 %
dtype: object

In [85]:
# Paso 3
# Aplicar dropna con thresh al 50%
# filas × 0.5 = 3 valores válidos mínimos
thresh = len(df_notas) * 0.5
df_new = df_notas.dropna(thresh=thresh, axis=1)
print(f"thresh = len(df_notas) * 0.5 = {len(df_notas)} × 0.5 = {thresh}")
print()
print("DataFrame después de eliminar columnas con más del 50% de nulos:")
print(df_new)

thresh = len(df_notas) * 0.5 = 6 × 0.5 = 3.0

DataFrame después de eliminar columnas con más del 50% de nulos:
  estudiante  nota_1  nota_2  nota_4
0        Ana    15.0    18.0    14.0
1       Luis    12.0     NaN    15.0
2      María     NaN    16.0    13.0
3     Carlos    14.0     NaN    16.0
4       Rosa     NaN     NaN    12.0
5      Jorge    11.0    13.0     NaN

In [103]:
# Paso 1
# Crear el DataFrame de ejemplo
data = {
'estudiante': ['Ana', 'Luis', 'María', 'Carlos', 'Rosa', 'Jorge'],
'nota_1': [15, 12, None, 14, None, 11 ],
'nota_2': [18, None, 16, None, None, 13 ],
'nota_3': [None, None, None, None, None, None ],
'nota_4': [14, 15, 13, 16, 12, None ],
}
df_notas = pd.DataFrame(data)
print("DataFrame original:")
print(df_notas)
print()

DataFrame original:
  estudiante  nota_1  nota_2 nota_3  nota_4
0        Ana    15.0    18.0   None    14.0
1       Luis    12.0     NaN   None    15.0
2      María     NaN    16.0   None    13.0
3     Carlos    14.0     NaN   None    16.0
4       Rosa     NaN     NaN   None    12.0
5      Jorge    11.0    13.0   None     NaN

In [104]:
# Paso 2
# Rellenar nulos con cero
cols_notas = ['nota_1', 'nota_2', 'nota_3', 'nota_4']
df_notas[cols_notas] = df_notas[cols_notas].apply(pd.to_numeric, errors='coerce')
#df_notas[cols_notas] = df_notas[cols_notas].fillna(0)
dft = df_notas.fillna(0)

df_notas.info()
print(df_notas)
print(dft)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   estudiante  6 non-null      object
 1   nota_1      4 non-null      float64
 2   nota_2      3 non-null      float64
 3   nota_3      0 non-null      float64
 4   nota_4      5 non-null      float64
dtypes: float64(4), object(1)
memory usage: 372.0+ bytes
  estudiante  nota_1  nota_2  nota_3  nota_4
0        Ana    15.0    18.0     NaN    14.0
1       Luis    12.0     NaN     NaN    15.0
2      María     NaN    16.0     NaN    13.0
3     Carlos    14.0     NaN     NaN    16.0
4       Rosa     NaN     NaN     NaN    12.0
5      Jorge    11.0    13.0     NaN     NaN
  estudiante  nota_1  nota_2  nota_3  nota_4
0        Ana    15.0    18.0     0.0    14.0
1       Luis    12.0     0.0     0.0    15.0
2      María     0.0    16.0     0.0    13.0
3     Carlos    14.0     0.0     0.0    16.0
4       Rosa     0.0     0.0     0.0    12.0
5      Jorge    11.0    13.0     0.0     0.0

In [106]:
# Crear DataFrame local
df_local = pd.DataFrame({
'empleado': ['Ana', 'Luis', 'María', 'Carlos', 'Rosa'],
'salario': [1500, 1600, np.nan, 1700, 50000],
'ciudad': ['Lima', np.nan, 'Arequipa', 'Cusco', np.nan],
'edad': [25, 30, np.nan, 28, 40]
})
print("DataFrame original:")
print(df_local)

# Rellenar cada columna con un valor adecuado
df_local = df_local.fillna({
'salario': df_local['salario'].median(), # Mediana (robusta ante outliers)
'ciudad': 'Desconocido', # Texto fijo para categoría
'edad': df_local['edad'].mean() # Media para edad
})
print("\nDataFrame después de imputar:")
print(df_local)

DataFrame original:
  empleado  salario    ciudad  edad
0      Ana   1500.0      Lima  25.0
1     Luis   1600.0       NaN  30.0
2    María      NaN  Arequipa   NaN
3   Carlos   1700.0     Cusco  28.0
4     Rosa  50000.0       NaN  40.0

DataFrame después de imputar:
  empleado  salario       ciudad   edad
0      Ana   1500.0         Lima  25.00
1     Luis   1600.0  Desconocido  30.00
2    María   1650.0     Arequipa  30.75
3   Carlos   1700.0        Cusco  28.00
4     Rosa  50000.0  Desconocido  40.00

In [107]:
# Promedio de salario por ciudad
df.groupby('ciudad')['salario'].mean()

ciudad
Arequipa    5320.708333
Chiclayo    5523.178571
Cusco       5564.500000
Lima        5380.896552
Piura       5143.526316
Trujillo    4961.419355
Name: salario, dtype: float64

In [108]:
# Múltiples agregaciones sobre múltiples columnas
df.groupby('ciudad').agg(
salario_promedio=('salario', 'mean'),
salario_maximo=('salario', 'max'),
total_empleados=('nombre', 'count')
)

          salario_promedio  salario_maximo  total_empleados
ciudad
Arequipa       5320.708333          7931.0               24
Chiclayo       5523.178571          7842.0               29
Cusco          5564.500000          7697.0               36
Lima           5380.896552          7949.0               31
Piura          5143.526316          7901.0               38
Trujillo       4961.419355          7764.0               32

In [109]:
# Agrupar por múltiples columnas
df.groupby(['ciudad', 'departamento'])['salario'].mean().reset_index()

      ciudad departamento      salario
0   Arequipa     Finanzas  5084.333333
1   Arequipa    Marketing  5620.200000
2   Arequipa  Operaciones  4977.000000
3   Arequipa         RRHH  5230.333333
4   Arequipa     Sistemas  5313.250000
5   Arequipa       Ventas  5548.000000
6   Chiclayo     Finanzas  5661.800000
7   Chiclayo    Marketing  5176.000000
8   Chiclayo  Operaciones  4994.750000
9   Chiclayo         RRHH  5341.750000
10  Chiclayo     Sistemas  5686.333333
11  Chiclayo       Ventas  7117.000000
12     Cusco     Finanzas  5429.666667
13     Cusco    Marketing  5011.250000
14     Cusco  Operaciones  5556.666667
15     Cusco         RRHH  6126.600000
16     Cusco     Sistemas  6677.333333
17     Cusco       Ventas  5386.400000
18      Lima     Finanzas  4953.142857
19      Lima    Marketing  4375.125000
20      Lima  Operaciones  6744.750000
21      Lima         RRHH  6714.833333
22      Lima     Sistemas  5513.000000
23      Lima       Ventas  2566.000000
24     Piura     Finanzas  4571.666667
25     Piura    Marketing  6176.333333
26     Piura  Operaciones  4590.500000
27     Piura         RRHH  3614.250000
28     Piura     Sistemas  6035.600000
29     Piura       Ventas  5237.666667
30  Trujillo     Finanzas  6481.000000
31  Trujillo    Marketing  4413.000000
32  Trujillo  Operaciones  3919.600000
33  Trujillo         RRHH  4358.000000
34  Trujillo     Sistemas  7124.000000
35  Trujillo       Ventas  5090.600000

In [110]:
# Agrupar por múltiples columnas
df.groupby(['ciudad', 'departamento'])['salario'].mean()

ciudad    departamento
Arequipa  Finanzas        5084.333333
          Marketing       5620.200000
          Operaciones     4977.000000
          RRHH            5230.333333
          Sistemas        5313.250000
          Ventas          5548.000000
Chiclayo  Finanzas        5661.800000
          Marketing       5176.000000
          Operaciones     4994.750000
          RRHH            5341.750000
          Sistemas        5686.333333
          Ventas          7117.000000
Cusco     Finanzas        5429.666667
          Marketing       5011.250000
          Operaciones     5556.666667
          RRHH            6126.600000
          Sistemas        6677.333333
          Ventas          5386.400000
Lima      Finanzas        4953.142857
          Marketing       4375.125000
          Operaciones     6744.750000
          RRHH            6714.833333
          Sistemas        5513.000000
          Ventas          2566.000000
Piura     Finanzas        4571.666667
          Marketing       6176.333333
          Operaciones     4590.500000
          RRHH            3614.250000
          Sistemas        6035.600000
          Ventas          5237.666667
Trujillo  Finanzas        6481.000000
          Marketing       4413.000000
          Operaciones     3919.600000
          RRHH            4358.000000
          Sistemas        7124.000000
          Ventas          5090.600000
Name: salario, dtype: float64

In [111]:
# Frecuencia absoluta
df['ciudad'].value_counts()

ciudad
Piura       38
Cusco       36
Trujillo    32
Lima        31
Chiclayo    29
Arequipa    24
Name: count, dtype: int64

In [112]:
# Frecuencia relativa (proporciones)
df['ciudad'].value_counts(normalize=True).round(2)

ciudad
Piura       0.20
Cusco       0.19
Trujillo    0.17
Lima        0.16
Chiclayo    0.15
Arequipa    0.13
Name: proportion, dtype: float64

In [114]:
df.pivot_table(
values='salario',
index='ciudad',
columns='departamento',
aggfunc='mean')

departamento     Finanzas    Marketing  Operaciones         RRHH     Sistemas       Ventas
ciudad
Arequipa      5084.333333  5620.200000  4977.000000  5230.333333  5313.250000  5548.000000
Chiclayo      5661.800000  5176.000000  4994.750000  5341.750000  5686.333333  7117.000000
Cusco         5429.666667  5011.250000  5556.666667  6126.600000  6677.333333  5386.400000
Lima          4953.142857  4375.125000  6744.750000  6714.833333  5513.000000  2566.000000
Piura         4571.666667  6176.333333  4590.500000  3614.250000  6035.600000  5237.666667
Trujillo      6481.000000  4413.000000  3919.600000  4358.000000  7124.000000  5090.600000

In [115]:
# Crear DataFrame con tipos como texto
df_local = pd.DataFrame({
'precio': ['100', '250', 'error', '300'],
'fecha': ['2024-01-10', '2024-02-15', '2024-03-20', '2024-04-25'],
'ciudad': ['Lima', 'Cusco', 'Lima', 'Arequipa']
})
print("DataFrame original:")
print(df_local)
print("\nTipos originales:")
print(df_local.dtypes)
# Convertir columna de texto a numérico
df_local['precio'] = pd.to_numeric(df_local['precio'], errors='coerce')
# errors='coerce' convierte valores no convertibles a NaN
# errors='raise' lanza error (default)
# errors='ignore' deja el valor original sin convertir
# Convertir columna de texto a fecha
df_local['fecha'] = pd.to_datetime(df_local['fecha'], format='%Y-%m-%d')
# Convertir a categórico (ahorra memoria en columnas con pocos valores únicos)
df_local['ciudad'] = df_local['ciudad'].astype('category')
# Verificar los tipos resultantes
print("\nTipos finales")
print(df_local.dtypes)

DataFrame original:
  precio       fecha    ciudad
0    100  2024-01-10      Lima
1    250  2024-02-15     Cusco
2  error  2024-03-20      Lima
3    300  2024-04-25  Arequipa

Tipos originales:
precio    object
fecha     object
ciudad    object
dtype: object

Tipos finales
precio           float64
fecha     datetime64[ns]
ciudad          category
dtype: object

In [116]:
df_enero = pd.DataFrame({'producto': ['A','B'], 'ventas': [100, 200]})
df_febrero = pd.DataFrame({'producto': ['A','C'], 'ventas': [150, 300]})
# Apilar verticalmente (eje de filas)
df_total = pd.concat([df_enero, df_febrero], ignore_index=True)
# Reporte
print("Enero:\n", df_enero)
print("Febrero:\n", df_febrero)
print("Todo:\n", df_total)

Enero:
   producto  ventas
0        A     100
1        B     200
Febrero:
   producto  ventas
0        A     150
1        C     300
Todo:
   producto  ventas
0        A     100
1        B     200
2        A     150
3        C     300

In [117]:
# DataFrame 1: Información de productos
df_productos = pd.DataFrame({
'id': [101, 102],
'nombre': ['Laptop', 'Mouse']
})
# DataFrame 2: Información de precios (para los mismos productos)
df_precios = pd.DataFrame({
'precio': [1200, 25],
'stock': [10, 50]
})
# Concatenar horizontalmente (eje de columnas)
df_combinado = pd.concat([df_productos, df_precios], axis=1)
# Reporte
print("Productos:\n", df_productos)
print("\nPrecios:\n", df_precios)
print("\nResultado (Columnas unidas):\n", df_combinado)

Productos:
     id  nombre
0  101  Laptop
1  102   Mouse

Precios:
    precio  stock
0    1200     10
1      25     50

Resultado (Columnas unidas):
     id  nombre  precio  stock
0  101  Laptop    1200     10
1  102   Mouse      25     50

In [124]:
df_empleados = pd.DataFrame({
'id': [1, 2, 3, 4],
'nombre': ['Ana', 'Luis', 'María', 'Gustavo'],
'depto_id': [10, 20, 10, 40]
})

df_deptos = pd.DataFrame({
'depto_id': [10, 20, 30],
'depto': ['Ventas', 'Sistemas', 'Compras']
})

print("Empleados:\n", df_empleados)
print("\nDepartamentos:\n", df_deptos)
# Inner join (solo registros con coincidencia en ambos)
resultado = pd.merge(df_empleados, df_deptos, on='depto_id', how='inner')
print("Resultado:\n", resultado)

Empleados:
    id   nombre  depto_id
0   1      Ana        10
1   2     Luis        20
2   3    María        10
3   4  Gustavo        40

Departamentos:
    depto_id     depto
0        10    Ventas
1        20  Sistemas
2        30   Compras
Resultado:
    id nombre  depto_id     depto
0   1    Ana        10    Ventas
1   2   Luis        20  Sistemas
2   3  María        10    Ventas

In [125]:
data = {
'nombre': ['Ana', 'Luis', 'María', 'Carlos', 'Elena'],
'edad': [25, 30, 28, 35, np.nan],
'ciudad': ['Lima', 'Cusco', 'Lima', 'Arequipa', 'Lima'],
'salario': [3500, 4200, 3800, 5100, 3200]
}
df = pd.DataFrame(data)
print(df)
# Exportar a CSV
df.to_csv('resultado.csv', index=False) # index=False evita guardar el índice
# Exportar a Excel
df.to_excel('resultado.xlsx', sheet_name='Datos', index=False)
# Exportar a JSON
df.to_json('resultado.json', orient='records', force_ascii=False)

   nombre  edad    ciudad  salario
0     Ana  25.0      Lima     3500
1    Luis  30.0     Cusco     4200
2   María  28.0      Lima     3800
3  Carlos  35.0  Arequipa     5100
4   Elena   NaN      Lima     3200

In [126]:
# 1. Crear el DataFrame principal (basado en tu imagen)
data = {
'nombre': ['Ana', 'Luis', 'María', 'Carlos', 'Elena'],
'edad': [25, 30, 28, 35, np.nan],
'ciudad': ['Lima', 'Cusco', 'Lima', 'Arequipa', 'Lima'],
'salario': [3500, 4200, 3800, 5100, 3200]
}
df = pd.DataFrame(data)
# 2. Crear df_ventas (una copia o filtro de tus datos)
df_ventas = df.copy()
# 3. Crear df_resumen (un resumen estadístico o agrupado)
# En este caso, calculamos el promedio de salario por ciudad
df_resumen = df.groupby('ciudad')['salario'].mean().reset_index()
# 4. Exportar a múltiples hojas en un mismo Excel
# Nota: Si te da error de 'openpyxl', ejecuta primero: !pip install openpyxl
with pd.ExcelWriter('reporte.xlsx') as writer:
     df_ventas.to_excel(writer, sheet_name='Ventas', index=False)
     df_resumen.to_excel(writer, sheet_name='Resumen', index=False)
print("¡Archivo 'reporte.xlsx' creado con éxito!")

¡Archivo 'reporte.xlsx' creado con éxito!